app/views/teams/show.html.erb

                <tbody>
                  <% @team.assigns.each do |assign| %>
---
SELECT "assigns".* FROM "assigns" WHERE "assigns"."team_id" = $1  [["team_id", 10]]