app/views/delete_agenda_mailer/delete_agenda_mail.html.erb

<h1>
  <%= I18n.t('views.messages.delete_agenda') %>
---
DELETE FROM "agendas" WHERE "agendas"."id" = $1  [["id", 10]]