app/controllers/agendas_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "agendas" ("title", "created_at", "updated_at", "team_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "samedi"], ["created_at", "2020-10-22 08:19:22.484794"], ["updated_at", "2020-10-22 08:19:22.484794"], ["team_id", 2], ["user_id", 1]]
---
  def create
    @agenda = current_user.agendas.build(title: params[:title])
    @agenda.team = Team.friendly.find(params[:team_id])
    current_user.keep_team_id = @agenda.team.id
    if current_user.save && @agenda.save

DELETE FROM "agendas" WHERE "agendas"."id" = $1  [["id", 10]]
---
  def destroy
    @agenda.destroy

SELECT  "agendas".* FROM "agendas" WHERE "agendas"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def set_agenda
    @agenda = Agenda.find(params[:id])