app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "groupe1"], ["owner_id", 14], ["created_at", "2020-10-24 16:57:07.418960"], ["updated_at", "2020-10-24 16:57:07.418960"]]
INSERT INTO "teams" ("name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "titi"], ["owner_id", 17], ["created_at", "2020-10-27 17:29:24.399206"], ["updated_at", "2020-10-27 17:29:24.399206"]]
---
  def create
    @team = Team.new(team_params)
    @team.owner = current_user
    if @team.save
      @team.invite_member(@team.owner)
      redirect_to @team, notice: I18n.t('views.messages.create_team')

INSERT INTO "teams" ("name", "owner_id", "created_at", "updated_at", "icon") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Prodder++++"], ["owner_id", 1], ["created_at", "2020-10-22 13:55:21.353474"], ["updated_at", "2020-10-22 13:55:21.353474"], ["icon", "article.jpg"]]
UPDATE "teams" SET "owner_id" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["owner_id", 13], ["updated_at", "2020-10-27 13:38:58.957863"], ["id", 10]]
---
  def owner_change
    if current_user.owner?(@working_team)
      @working_team.owner_id = params[:id]
      @working_team.save

UPDATE "teams" SET "icon" = $1, "owner_id" = $2, "updated_at" = $3 WHERE "teams"."id" = $4  [["icon", "article.jpg"], ["owner_id", 2], ["updated_at", "2020-10-22 14:09:50.065424"], ["id", 3]]
UPDATE "teams" SET "owner_id" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["owner_id", 13], ["updated_at", "2020-10-28 07:09:51.713790"], ["id", 11]]
---
  def update
    if @team.update(team_params)
      redirect_to @team, notice: I18n.t('views.messages.update_team')

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def dashboard
    @team = current_user.keep_team_id ? Team.find(current_user.keep_team_id) : current_user.teams.first

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_team
    @team = Team.friendly.find(params[:id])